[
  {
    "name": "Chole Masala",
    "time": "45 min",
    "likes": 3120,
    "image": "assets/images/chole-masala.jpg",
    "youtube": "https://www.youtube.com/watch?v=M-ohmJswy6A",
    "ingredients": [
      "onion",
      "tomato",
      "salt",
      "oil",
      "spices",
      "ginger",
      "garlic",
      "green chili"
    ],
    "benefits":[ "Chole masala is rich in protein and fiber, making it a healthy vegetarian option. It is also packed with vitamins and minerals from the spices used."],
    "description": "Chole masala is a popular North Indian dish made with chickpeas cooked in a spicy and tangy tomato-onion gravy. It is often served with bhature, puri, or rice.",
    "steps": [
      "Soak chickpeas overnight in water.",
      "Pressure cook soaked chickpeas until soft (4-5 whistles).",
      "Heat oil in a pan and add cumin seeds.",
      "Add finely chopped onions and sauté till golden brown.",
      "Add ginger-garlic paste and green chilies.",
      "Add chopped tomatoes and cook until mushy.",
      "Add turmeric, red chili, coriander, and chole masala powder.",
      "Mix and sauté the masala till oil starts separating.",
      "Mash a few chickpeas to thicken the gravy.",
      "Add boiled chickpeas to the masala and mix well.",
      "Add water as required for gravy consistency.",
      "Simmer the curry for 10–15 minutes on low heat.",
      "Add salt and check for seasoning.",
      "Garnish with chopped coriander.",
      "Squeeze some lemon juice for tanginess.",
      "Optional: Add a pinch of garam masala before serving.",
      "Serve hot with bhature or jeera rice.",
      "You can also serve it with roti or puri.",
      "Leftover chole can be stored in refrigerator for 2 days.",
      "Reheat before serving and enjoy!"
    ]
  },
  {
    "name": "Paneer Butter Masala",
    "time": "30 min",
    "likes": 2500,
    "image": "assets/images/paneer-butter-masala.jpg",
    "youtube": "https://youtu.be/oYZ--rdHL6I?si=nRndXcBTNR4cE0Y5",
    "ingredients": [
      "paneer",
      "butter",
      "cream",
      "tomato puree",
      "onion",
      "spices",
      "ginger-garlic paste",
      "kasuri methi"
    ],
    "benefits": ["Paneer butter masala is a rich source of protein and calcium from paneer. The spices used in the dish also have anti-inflammatory properties."],
    "description": "Paneer butter masala is a creamy and flavorful North Indian dish made with paneer (Indian cottage cheese) cooked in a rich tomato-based gravy with butter and cream. It is often served with naan or roti.",
    "steps": [
      "Heat butter in a pan and add cumin seeds.",
      "Add finely chopped onions and sauté till golden brown.",
      "Add ginger-garlic paste and sauté for a minute.",
      "Add tomato puree and cook until oil separates.",
      "Add red chili powder, turmeric, and garam masala.",
      "Mix well and cook for 5 minutes.",
      "Add paneer cubes and mix gently to coat with masala.",
      "Add cream and mix well.",
      "Crush kasuri methi between palms and add to the curry.",
      "Simmer for 5 minutes on low heat.",
      "Adjust salt as needed.",
      "Garnish with fresh coriander leaves.",
      "Serve hot with naan or roti."
    ]
  },
  {
    "name": "Vegetable Biryani",
    "time": "60 min",
    "likes": 1800,
    "image": "assets/images/vegetable-biryani.jpg",
    "youtube": "https://youtu.be/S5Ngh6CFRmc?si=Wdnt8WviLt1bjNHw",
    "ingredients": [
      "basmati rice",
      "mixed vegetables",
      "onion",
      "tomato",
      "spices",
      "ginger-garlic paste",
      "yogurt",
      "mint leaves"
    ],
    "benefits": ["Vegetable biryani is a wholesome meal packed with nutrients from various vegetables. Basmati rice is low in fat and high in carbohydrates, providing energy."],
    "description": "Vegetable biryani is a fragrant and flavorful rice dish made with basmati rice and a mix of vegetables, cooked with aromatic spices. It is a one-pot meal that is often served with raita or salad.",
    "steps": [
      "Wash and soak basmati rice for 30 minutes.",
      "Heat oil in a pressure cooker and add whole spices.",
      "Add sliced onions and sauté till golden brown.",
      "Add ginger-garlic paste and cook for a minute.",
      "Add chopped tomatoes and cook until soft.",
      "Add mixed vegetables and cook for 5 minutes.",
      "Add yogurt, mint leaves, and biryani masala.",
      "Mix well and cook for another 5 minutes.",
      "Drain soaked rice and add to the cooker.",
      "Add water (1.5 cups for 1 cup rice) and salt to taste.",
      "Close the lid and cook on high heat for 2 whistles.",
      "Reduce heat and simmer for 10 minutes.",
      "Turn off heat and let it rest for 10 minutes before opening the lid.",
      "Fluff the biryani with a fork and serve hot with raita."
    ]
  },
  {
    "name": "Dal Tadka",
    "time": "40 min",
    "likes": 2200,
    "image": "assets/images/dal-tadka.jpg",
    "youtube": "https://youtu.be/tmiGPrOiUQE?si=azvb6H88WO_xLDm1",
    "ingredients": [
      "toor dal",
      "onion",
      "tomato",
      "ginger-garlic paste",
      "green chili",
      "spices",
      "cumin seeds",
      "coriander leaves"
    ],
    "steps": [
      "Wash and soak toor dal for 30 minutes.",
      "Pressure cook dal with water and turmeric until soft.",
      "Heat oil in a pan, add cumin seeds and let them splutter.",
      "Add chopped onions and sauté till golden brown.",
      "Add ginger-garlic paste and green chili, sauté for a minute.",
      "Add chopped tomatoes and cook until soft.",
      "Add cooked dal, salt, and water as needed for consistency.",
      "Simmer for 10 minutes on low heat.",
      "Garnish with coriander leaves.",
      "Serve hot with rice or roti."
    ]
  },
  {
    "name": "Aloo Gobi",
    "time": "30 min",
    "likes": 1500,
    "image": "assets/images/aloo-gobi.jpg",
    "youtube": "https://youtu.be/JihdOvkxQC8?si=9-8ITV3i2Gb_ORqq",
    "ingredients": [
      "potato",
      "cauliflower",
      "onion",
      "tomato",
      "spices",
      "ginger-garlic paste",
      "green chili"
    ],
    "benefits": ["Aloo Gobi is a low-calorie dish rich in vitamins and minerals. Potatoes provide energy, while cauliflower is high in fiber and antioxidants."],
    "description": "Aloo Gobi is a classic Indian vegetarian dish made with potatoes and cauliflower cooked with spices. It is a dry curry that pairs well with roti or paratha.",
    "steps": [
      "Cut potatoes and cauliflower into small pieces.",
      "Heat oil in a pan, add cumin seeds and let them splutter.",
      "Add chopped onions and sauté till golden brown.",
      "Add ginger-garlic paste and green chili, sauté for a minute.",
      "Add chopped tomatoes and cook until soft.",
      "Add turmeric, red chili powder, and salt.",
      "Add potatoes and cauliflower, mix well.",
      "Cover and cook on low heat until vegetables are tender.",
      "Garnish with coriander leaves.",
      "Serve hot with roti or paratha."
    ]
  },
  {
    "name": "Palak Paneer",
    "time": "35 min",
    "likes": 2000,
    "image": "assets/images/palak-paneer.jpg",
    "youtube": "https://youtu.be/JI4DtsiYm34?si=HFEz39Zm1yebd7cQ",
    "ingredients": [
      "palak (spinach)",
      "paneer",
      "onion",
      "tomato",
      "ginger-garlic paste",
      "spices",
      "cream"
    ],
    "benefits": ["Palak Paneer is rich in iron and calcium from spinach and paneer. It is also a good source of vitamins A and C."],
    "description": "Palak Paneer is a popular North Indian dish made with paneer (Indian cottage cheese) cooked in a smooth spinach gravy. It is nutritious and flavorful, often served with naan or rice.",
    "steps": [
      "Blanch palak leaves in boiling water for 2 minutes.",
      "Cool and blend to a smooth paste.",
      "Heat oil in a pan, add cumin seeds and let them splutter.",
      "Add chopped onions and sauté till golden brown.",
      "Add ginger-garlic paste and sauté for a minute.",
      "Add chopped tomatoes and cook until soft.",
      "Add palak puree, salt, and spices, mix well.",
      "Add paneer cubes and simmer for 5 minutes.",
      "Stir in cream and cook for another 2 minutes.",
      "Garnish with coriander leaves.",
      "Serve hot with naan or rice."
    ]
  },
  {
    "name": "Rajma",
    "time": "50 min",
    "likes": 2700,
    "image": "assets/images/rajma.jpg",
    "youtube": "https://youtu.be/8IOZ7-32Q3Y?si=a7vtHTqnAFQJnW6i",
    "ingredients": [
      "kidney beans (rajma)",
      "onion",
      "tomato",
      "ginger-garlic paste",
      "spices",
      "green chili",
      "coriander leaves"
    ],
    "benefits": ["Rajma is a great source of protein and fiber, making it a healthy vegetarian option. It also contains essential vitamins and minerals."],
    "description": "Rajma is a North Indian dish made with kidney beans cooked in a spicy tomato gravy. It is often served with rice or roti and is a comfort food for many.",
    "steps": [
      "Soak rajma overnight in water.",
      "Pressure cook rajma with water and salt until soft.",
      "Heat oil in a pan, add cumin seeds and let them splutter.",
      "Add chopped onions and sauté till golden brown.",
      "Add ginger-garlic paste and green chili, sauté for a minute.",
      "Add chopped tomatoes and cook until soft.",
      "Add turmeric, red chili powder, and garam masala.",
      "Mix well and cook for 5 minutes.",
      "Add cooked rajma and mix gently.",
      "Simmer for 10 minutes on low heat.",
      "Garnish with coriander leaves.",
      "Serve hot with rice or roti."
    ]
  },
  {
    "name": "Baingan Bharta",
    "time": "40 min",
    "likes": 1600,
    "image": "assets/images/baingan-bharta.jpg",
    "youtube": "https://youtu.be/yRZKfDI28Ro?si=OxWPSx3zjiS-xm-J",
    "ingredients": [
      "baingan (eggplant)",
      "onion",
      "tomato",
      "ginger-garlic paste",
      "spices",
      "green chili",
      "coriander leaves"
    ],
    "benefits": ["Baingan Bharta is low in calories and high in fiber. Eggplant is rich in antioxidants and vitamins, making it a healthy choice."],
    "description": "Baingan Bharta is a smoky-flavored Indian dish made with roasted eggplant mashed and cooked with spices. It is typically served with roti or paratha.",
    "steps": [
      "Roast baingan over an open flame until charred.",
      "Cool, peel off the skin, and mash the flesh.",
      "Heat oil in a pan, add cumin seeds and let them splutter.",
      "Add chopped onions and sauté till golden brown.",
      "Add ginger-garlic paste and green chili, sauté for a minute.",
      "Add chopped tomatoes and cook until soft.",
      "Add turmeric, red chili powder, and salt.",
      "Add mashed baingan and mix well.",
      "Cook for 10 minutes on low heat.",
      "Garnish with coriander leaves.",
      "Serve hot with roti or paratha."
    ]
  },
  {
    "name": "Pasta",
    "time": "25 min",
    "likes": 1400,
    "image": "assets/images/pasta.jpg",
    "youtube": "https://youtu.be/yVDz0Av-s2A?si=SCtctFFpDjPB7Xmq",
    "ingredients": [
      "pasta",
      "olive oil",
      "garlic",
      "vegetables (bell pepper, zucchini, etc.)",
      "tomato sauce",
      "basil",
      "salt",
      "pepper"
    ],  
    "benefits": ["Pasta is a good source of carbohydrates, providing energy. Adding vegetables increases the fiber and vitamin content, making it a balanced meal."],
    "description": "Pasta is a versatile Italian dish that can be made with various sauces and ingredients. This recipe features a simple vegetable pasta with a tomato sauce.",
    "steps": [
      "Boil water in a pot, add salt and pasta, cook until al dente.",
      "Drain and set aside.",
      "Heat olive oil in a pan, add minced garlic and sauté for a minute.",
      "Add chopped vegetables and cook until tender.",
      "Add tomato sauce, salt, and pepper, mix well.",
      "Add cooked pasta to the sauce and toss to combine.",
      "Cook for another 2-3 minutes on low heat.",
      "Garnish with fresh basil leaves.",
      "Serve hot with grated cheese if desired."
    ]
  },
  {
    "name": "White Sauce Pasta",
    "time": "30 min",
    "likes": 1300,
    "image": "assets/images/white-sauce-pasta.jpg",
    "youtube": "https://youtu.be/ZmPWifgAvJg?si=AvyxJmzSBuc5FC4O",
    "ingredients": [
      "pasta",
      "butter",
      "flour",
      "milk",
      "garlic",
      "cheese",
      "salt",
      "pepper",
      "nutmeg"
    ],
    "benefits": ["White sauce pasta is creamy and comforting. The addition of cheese provides calcium, while the pasta offers carbohydrates for energy."],
    "description": "White sauce pasta is a creamy pasta dish made with a rich white sauce (béchamel) and cheese. It is a favorite among kids and adults alike.",
    "steps": [
      "Boil pasta in salted water until al dente, drain and set aside.",
      "In a pan, melt butter and add minced garlic, sauté for a minute.",
      "Add flour and cook for 2-3 minutes to form a roux.",
      "Gradually whisk in milk, stirring continuously to avoid lumps.",
      "Cook until the sauce thickens, then add salt, pepper, and a pinch of nutmeg.",
      "Stir in grated cheese until melted and smooth.",
      "Add cooked pasta to the sauce and mix well.",
      "Cook for another 2-3 minutes on low heat.",
      "Serve hot with extra cheese on top if desired."
    ]
  },
  {
    "name": "Chocolate Cake",
    "time": "60 min",
    "likes": 3500,
    "image": "assets/images/chocolate-cake.jpg",
    "youtube": "https://youtu.be/vI5w-fK25w4?si=11W9XL5I7mn0YGJN",
    "ingredients": [
      "all-purpose flour",
      "cocoa powder",
      "sugar",
      "baking powder",
      "baking soda",
      "salt",
      "eggs",
      "milk",
      "vegetable oil",
      "vanilla extract"
    ],
    "benefits": ["Chocolate cake is a delightful treat that can boost mood due to the presence of cocoa, which contains flavonoids. Enjoy in moderation as part of a balanced diet."],
    "description": "Chocolate cake is a rich and moist dessert made with cocoa powder and baked to perfection. It is often frosted with chocolate icing and enjoyed on special occasions.",
    "steps": [
      "Preheat oven to 350°F (175°C). Grease and flour a cake pan.",
      "In a bowl, mix flour, cocoa powder, sugar, baking powder, baking soda, and salt.",
      "In another bowl, whisk eggs, milk, oil, and vanilla extract.",
      "Combine wet and dry ingredients until smooth.",
      "Pour batter into the prepared pan and bake for 30-35 minutes.",
      "Check with a toothpick; it should come out clean.",
      "Let the cake cool before frosting with chocolate icing."
    ]
  },
  {
    "name": "Vegetable Stir Fry",
    "time": "20 min",
    "likes": 1100,
    "image": "assets/images/vegetable-stir-fry.jpg",
    "youtube": "https://youtu.be/spDs_wzn8To?si=O0PVvJPjP9CDF9-c",
    "ingredients": [
      "mixed vegetables (carrot, bell pepper, broccoli)",
      "soy sauce",
      "ginger",
      "garlic",
      "sesame oil",
      "sesame seeds"
    ],
    "benefits": ["Vegetable stir fry is a quick and healthy dish packed with vitamins and minerals from various vegetables. It is low in calories and high in fiber."],
    "description": "Vegetable stir fry is a quick and healthy dish made with a mix of colorful vegetables sautéed in sesame oil and flavored with soy sauce. It is perfect as a side dish or main course.",
    "steps": [
      "Heat sesame oil in a pan or wok.",
      "Add minced garlic and ginger, sauté for a minute.",
      "Add mixed vegetables and stir-fry on high heat for 5-7 minutes.",
      "Add salt and pepper to taste.",
      "Add soy sauce and mix well.",
      "Cook for another 2-3 minutes until vegetables are tender-crisp.",
      "Sprinkle sesame seeds on top before serving.",
      "Serve hot with steamed rice or noodles."
    ]
  },
  {
    "name": "Samosa",
    "time": "90 min",
    "likes": 2800,
    "image": "assets/images/samosa.jpg",
    "youtube": "https://youtu.be/EKPAfUCn_Jo?si=emBiB4wien7daYQ6",
    "ingredients": [
      "all-purpose flour",
      "potatoes",
      "peas",
      "spices (cumin, coriander, garam masala)",
      "ginger",
      "green chili",
      "oil for frying"
    ],
    "benefits": ["Samosas are a popular snack that can be made healthier by using less oil. The filling of potatoes and peas provides carbohydrates and protein."],
    "description": "Samosa is a popular Indian snack made with a crispy pastry filled with spiced potatoes and peas. It is deep-fried until golden brown and served with chutney.",
    "steps": [
      "Make a dough with flour, water, and a pinch of salt. Rest for 30 minutes.",
      "Boil and mash potatoes, mix with boiled peas, spices, ginger, and green chili.",
      "Heat oil in a pan, add cumin seeds, and sauté the potato mixture for 5 minutes.",
      "Let the filling cool down.",
      "Divide dough into small balls, roll out into thin circles.",
      "Place a spoonful of filling in the center of each circle.",
      "Fold the circle in half to form a semi-circle, sealing the edges with water.",
      "Roll the edges to form a cone shape.",
      "Fill the cone with more potato filling, sealing the top edge.",
      "Heat oil in a deep pan for frying.",
      "Fry the samosas in hot oil until golden brown and crispy.",
      "Remove and drain on paper towels.",
      "Serve hot with mint chutney or tamarind sauce."
    ]
  },
  {
    "name": "Paneer Tikka",
    "time": "40 min",
    "likes": 2300,
    "image": "assets/images/paneer-tikka.jpg",
    "youtube": "https://youtu.be/Ccga9wOkA4c?si=2fbpC0HSwugUU0st",
    "ingredients": [
      "paneer",
      "yogurt",
      "spices (tikka masala, turmeric, red chili powder)",
      "bell peppers",
      "onion",
      "lemon juice",
      "skewers"
    ],
    "benefits": ["Paneer Tikka is a great source of protein and calcium. The spices used in the marinade have anti-inflammatory properties."],
    "description": "Paneer Tikka is a popular Indian appetizer made with marinated paneer and vegetables grilled to perfection. It is often served with mint chutney and lemon wedges.",
    "steps": [
      "Cut paneer and vegetables into cubes.",
      "In a bowl, mix yogurt, spices, and lemon juice to make the marinade.",
      "Add salt to taste and mix well.",
      "Add paneer and vegetables to the marinade, coat well, and let it marinate for 30 minutes.",
      "Soak skewers in water if using wooden ones.",
      "Preheat the grill or oven to medium-high heat.",
      "Thread marinated paneer and vegetables onto skewers.",
      "Brush with oil and place on the grill or in the oven.",
      "Grill or bake for 15-20 minutes, turning occasionally until charred.",
      "Remove from skewers and garnish with lemon wedges and onion rings.",
      "Serve hot with mint chutney and lemon wedges."
    ]
  },
  {
    "name": "Masoor Dal",
    "time": "30 min",
    "likes": 1900,
    "image": "assets/images/masoor-dal.jpg",
    "youtube": "https://youtu.be/GwxIO8K-FrY?si=A2pxXxDIlSO6QgCq",
    "ingredients": [
      "masoor dal (red lentils)",
      "onion",
      "tomato",
      "ginger-garlic paste",
      "spices (cumin, turmeric, red chili powder)",
      "coriander leaves"
    ],
    "benefits": ["Masoor Dal is rich in protein and fiber, making it a healthy vegetarian option. It is also low in fat and contains essential vitamins and minerals."],
    "description": "Masoor Dal is a simple and nutritious Indian lentil dish made with red lentils cooked with spices and garnished with coriander leaves. It is often served with rice or roti.",
    "steps": [
      "Wash and soak masoor dal for 15 minutes.",
      "Pressure cook dal with water and turmeric until soft.",
      "Heat oil in a pan, add cumin seeds and let them splutter.",
      "Add chopped onions and sauté till golden brown.",
      "Add ginger-garlic paste and sauté for a minute.",
      "Add chopped tomatoes and cook until soft.",
      "Add cooked dal, salt, and water as needed for consistency.",
      "Simmer for 10 minutes on low heat.",
      "Garnish with coriander leaves.",
      "Serve hot with rice or roti."
    ]
  },
  {
    "name": "Methi Thepla",
    "time": "30 min",
    "likes": 1700,
    "image": "assets/images/methi-thepla.jpg",
    "youtube": "https://youtu.be/l-6wWsZoFpE?si=MjzEPXYauHmY5MRE",
    "ingredients": [
      "whole wheat flour",
      "fenugreek leaves (methi)",
      "yogurt",
      "spices (turmeric, red chili powder, cumin seeds)",
      "ginger",
      "green chili",
      "oil"
    ],
    "benefits": ["Methi Thepla is a nutritious flatbread made with fenugreek leaves, which are rich in iron and vitamins. It is a healthy option for breakfast or snacks."],
    "description": "Methi Thepla is a traditional Gujarati flatbread made with whole wheat flour and fenugreek leaves. It is spiced and soft, making it a perfect accompaniment for yogurt or pickle.",
    "steps": [
      "Wash and chop fenugreek leaves finely.",
      "In a bowl, mix whole wheat flour, chopped methi, yogurt, spices, ginger, and green chili.",
      "Knead into a soft dough using water as needed.",
      "Divide the dough into small balls and roll out into thin circles.",
      "Heat a tawa or skillet, cook the rolled out dough on both sides until golden brown.",
      "Brush with oil while cooking.",
      "Serve hot with yogurt or pickle."
    ]
  },
  {
    "name": "Pav Bhaji",
    "time": "50 min",
    "likes": 3000,
    "image": "assets/images/pav-bhaji.jpg",
    "youtube": "https://youtu.be/sAnPUIvPc1I?si=QQsAoWvzrkIQKFl_",
    "ingredients": [
      "mixed vegetables (potato, peas, carrot, capsicum)",
      "onion",
      "tomato",
      "ginger-garlic paste",
      "pav bhaji masala",
      "butter",
      "pav (bread rolls)",
      "coriander leaves"
    ],
    "benefits": ["Pav Bhaji is a hearty dish packed with vegetables, providing essential vitamins and minerals. It is a popular street food that can be made healthier by using less butter."],
    "description": "Pav Bhaji is a popular Indian street food made with a spicy vegetable mash served with buttered bread rolls (pav). It is a flavorful and filling dish enjoyed by many.",
    "steps": [
      "Boil and mash mixed vegetables.",
      "Heat butter in a pan, add cumin seeds and let them splutter.",
      "Add chopped onions and sauté till golden brown.",
      "Add ginger-garlic paste and sauté for a minute.",
      "Add chopped tomatoes and cook until soft.",
      "Add pav bhaji masala, salt, and mashed vegetables, mix well.",
      "Cook for 10-15 minutes on low heat, adding water as needed.",
      "Toast pav in butter on a separate pan until golden brown.",
      "Serve bhaji hot with toasted pav, garnished with coriander leaves and lemon wedges."
    ]
  },
  {
    "name": "Dhokla",
    "time": "40 min",
    "likes": 1600,
    "image": "assets/images/dhokla.jpg",
    "youtube": "https://youtu.be/w_2eb9uaXns?si=zd75N0qKVUdIw8om",
    "ingredients": [
      "gram flour (besan)",
      "yogurt",
      "ginger paste",
      "green chili paste",
      "turmeric powder",
      "baking soda",
      "salt",
      "mustard seeds",
      "curry leaves"
    ],
    "benefits": ["Dhokla is a steamed snack that is low in calories and high in protein due to gram flour. It is a healthy option for breakfast or snacks."],
    "description": "Dhokla is a popular Gujarati snack made from fermented gram flour batter steamed to perfection. It is light, fluffy, and often served with green chutney and sweet chutney.",
    "steps": [
      "In a bowl, mix gram flour, yogurt, ginger paste, green chili paste, turmeric powder, and salt.",
      "Add water to make a smooth batter and let it rest for 15 minutes.",
      "Add baking soda just before steaming.",
      "Grease a steaming tray and pour the batter into it.",
      "Fill a steamer with water and bring it to a boil.",
      "Pour the batter into a greased steaming tray.",
      "Steam for 15-20 minutes until a toothpick comes out clean.",
      "Let it cool slightly before removing from the tray.",
      "Cut into squares or diamond shapes.",
      "In a pan, heat oil, add mustard seeds and curry leaves for tempering.",
      "Once mustard seeds splutter, pour the tempering over the dhokla.",
      "Garnish with chopped coriander and grated coconut if desired.",
      "Serve with green chutney and sweet chutney." 
    ]
  },
  {
    "name": "Gulab Jamun",
    "time": "90 min",
    "likes": 4000,
    "image": "assets/images/gulab-jamun.jpg",
    "youtube": "https://youtu.be/QFvd7u_YjVk?si=3xsJysZfxnKyODRf",
    "ingredients": [
      "milk powder",
      "all-purpose flour",
      "baking soda",
      "ghee (clarified butter)",
      "milk",
      "sugar",
      "water",
      "rose water",
      "cardamom"
    ],
    "benefits": ["Gulab Jamun is a popular Indian dessert made from milk solids and sugar syrup. It is a treat that can be enjoyed in moderation as part of a balanced diet."],
    "description": "Gulab Jamun is a classic Indian sweet made from khoya (milk solids) shaped into balls, deep-fried, and soaked in a fragrant sugar syrup. It is a favorite dessert during festivals and celebrations.",
    "steps": [
      "In a bowl, mix milk powder, all-purpose flour, and baking soda.",
      "Add ghee and mix until crumbly.",
      "Gradually add milk to form a soft dough, let it rest for 15 minutes.",
      "In a separate pan, prepare sugar syrup by boiling sugar and water until dissolved.",
      "Add rose water and cardamom to the syrup, set aside.",
      "In a pan, heat sugar and water to make a syrup, add rose water and cardamom.",
      "Divide the dough into small balls, ensuring no cracks.",
      "Heat ghee in a deep pan for frying.",
      "Fry the balls on low heat until golden brown, ensuring even cooking.",
      "Remove and soak in warm sugar syrup for at least 30 minutes.",
      "Serve warm or at room temperature."
    ]
  },
  {
    "name": "Lassi",
    "time": "10 min",
    "likes": 900,
    "image": "assets/images/lassi.jpg",
    "youtube": "https://youtu.be/7RWheXehbyE?si=bKEaEx6NKFxGJdRn",
    "ingredients": [
      "yogurt",
      "water",
      "sugar",
      "cardamom powder",
      "ice cubes",
      "mint leaves (optional)"
    ],
    "benefits": ["Lassi is a refreshing yogurt-based drink that aids digestion and provides probiotics. It is hydrating and can be enjoyed as a cooling beverage during hot weather."],
    "description": "Lassi is a traditional Indian yogurt-based drink that can be sweet or salty. This recipe features a sweet lassi flavored with cardamom and served chilled.",
    "steps": [
      "In a blender, combine yogurt, water, sugar, and cardamom powder.",
      "Blend until smooth and frothy.",
      "Adjust sugar to taste.",
      "Add ice cubes and blend again briefly.",
      "Pour into glasses and garnish with mint leaves if desired.",
      "Serve chilled."
    ]
  },
  {
    "name": "Masala Chai",
    "time": "15 min",
    "likes": 1200,
    "image": "assets/images/masala-chai.jpg",
    "youtube": "https://youtu.be/2KI-PGM7PYQ?si=ghIA1PzpR5_YkG8K",
    "ingredients": [
      "water",
      "milk",
      "tea leaves",
      "sugar",
      "spices (ginger, cardamom, cloves, cinnamon)"
    ],
    "benefits": ["Masala Chai is a comforting beverage that combines the benefits of tea and spices. It can boost metabolism and has anti-inflammatory properties."],
    "description": "Masala Chai is a traditional Indian spiced tea made with black tea leaves, milk, and a blend of spices. It is a popular beverage enjoyed throughout the day.",
    "steps": [
      "Boil water in a saucepan.",
      "Add crushed ginger, cardamom, cloves, and cinnamon.",
      "Let it simmer for 2-3 minutes to infuse the spices.",
      "Add tea leaves and spices, simmer for 5 minutes.",
      "Add milk and sugar, bring to a boil.",
      "Reduce heat and simmer for another 2-3 minutes.",
      "Strain the tea into cups.",
      "Adjust sugar to taste.",
      "Garnish with a sprinkle of cardamom powder if desired.",
      "Serve hot with biscuits or snacks."
    ]
  },
  {
    "name": "Pani Puri",
    "time": "60 min",
    "likes": 3500,
    "image": "assets/images/pani-puri.jpg",
    "youtube": "https://youtu.be/zkbDNyV9G3w?si=bngAqcIYzVDWfvjH",
    "ingredients": [
      "semolina (suji)",
      "all-purpose flour",
      "water",
      "salt",
      "boiled potatoes",
      "chickpeas",
      "pani puri masala",
      "tamarind chutney"
    ],
    "benefits": ["Pani Puri is a fun and flavorful snack that can be made healthier by using less oil for frying. The combination of potatoes and chickpeas provides carbohydrates and protein."],
    "description": "Pani Puri is a popular Indian street food consisting of hollow puris filled with a spicy mixture of mashed potatoes and chickpeas, served with flavored water (pani). It is a delightful burst of flavors in every bite.",
    "steps": [
      "Mix semolina, all-purpose flour, and salt with water to form a dough.",
      "Knead well and let it rest for 30 minutes.",
      "Roll out small puris and deep fry until puffed and golden.",
      "For the filling, mash boiled potatoes and mix with boiled chickpeas.",
      "Add pani puri masala and salt to taste.",
      "For the pani, mix water with pani puri masala and tamarind chutney.",
      "Assemble by breaking a small hole in the puri, filling it with the potato-chickpea mixture, and dipping it in the pani.",
      "Serve immediately for best taste.",
      "Enjoy with extra pani and chutney on the side.",
      "Optional: Garnish with chopped coriander and sev for extra crunch.",
      "Serve with chilled pani for a refreshing taste.",
      "Pani puri is best enjoyed fresh, so prepare the puris just before serving.",
      "You can also serve with a side of sweet chutney for added flavor.",
      "Leftover puris can be stored in an airtight container for a day.",
      "Reheat in a microwave for a few seconds to make them crispy again.",
      "Pani puri is a popular street food, so feel free to experiment with different fillings and pani flavors.",
      "Enjoy the burst of flavors with every bite!",
      "Pani puri is a fun and interactive dish, perfect for parties and gatherings.",
      "You can also serve it with a variety of chutneys like mint, coriander, or sweet chutney.",
      "Feel free to adjust the spice levels according to your taste." 

    ]
  },
  {
    "name": "Chole Bhature",
    "time": "90 min",
    "likes": 4000,
    "image": "assets/images/chole-bhature.jpg",
    "youtube": "https://youtu.be/CcJazpU9seo?si=7DH0rDjj7txfuS8C",
    "ingredients": [
      "chickpeas (chole)",
      "onion",
      "tomato",
      "ginger-garlic paste",
      "spices (cumin, coriander, garam masala)",
      "bhature dough (flour, yogurt, baking powder)",
      "oil for frying"
    ],
    "benefits": ["Chole Bhature is a hearty meal that provides protein from chickpeas and carbohydrates from bhature. It is a popular North Indian dish enjoyed by many."],
    "description": "Chole Bhature is a classic North Indian dish consisting of spicy chickpeas (chole) served with deep-fried bread (bhature). It is a favorite breakfast or lunch option in many households.",
    "steps": [
      "Soak chickpeas overnight and boil until soft.",
      "In a pan, heat oil and add cumin seeds.",
      "Add chopped onions and sauté till golden brown.",
      "Add ginger-garlic paste and sauté for a minute.",
      "Add chopped tomatoes and cook until soft.",
      "Add spices and mix well.",
      "Add boiled chickpeas and simmer for 10-15 minutes.",
      "For bhature, mix flour, yogurt, baking powder, and water to make a soft dough.",
      "Let it rest for 30 minutes.",
      "Divide dough into small balls and roll out into circles.",
      "Heat oil in a deep pan and fry bhature until puffed and golden brown.",
      "Serve hot chole with bhature, sliced onions, and lemon wedges."
    ]
  },
  {
    "name": "Aloo Paratha",
    "time": "40 min",
    "likes": 2500,
    "image": "assets/images/aloo-paratha.jpg",
    "youtube": "https://youtu.be/jLmYDZ2zjSg?si=Zk1iPfv6sQIj7wMX",
    "ingredients": [
      "whole wheat flour",
      "potatoes",
      "onion",
      "spices (cumin, coriander, garam masala)",
      "green chili",
      "ginger",
      "oil or ghee"
    ],
    "benefits": ["Aloo Paratha is a filling breakfast option that provides carbohydrates from potatoes and whole wheat flour. It is often served with yogurt or pickle for added flavor."],
    "description": "Aloo Paratha is a popular North Indian stuffed flatbread made with spiced mashed potatoes. It is usually served with yogurt, pickle, or butter and is a favorite breakfast dish.",
    "steps": [
      "Boil and mash potatoes, mix with chopped onions, spices, green chili, and ginger.",
      "Knead whole wheat flour with water to make a soft dough.",
      "Divide dough into small balls, roll out into circles.",
      "Place a spoonful of potato filling in the center, fold and seal the edges.",
      "Roll out gently to flatten the stuffed dough.",
      "Heat a tawa or skillet, cook the paratha on both sides until golden brown.",
      "Brush with oil or ghee while cooking.",
      "Serve hot with yogurt, pickle, or butter."
    ]
  },
  {
    "name": "Halwa (Suji Halwa)",
    "time": "30 min",
    "likes": 1800,
    "image": "assets/images/halwa.jpg",
    "youtube": "https://youtu.be/NwL7x6qqt7E?si=JXslpvQQT9lKbSoD",
    "ingredients": [
      "semolina (suji)",
      "ghee (clarified butter)",
      "sugar",
      "water or milk",
      "cardamom powder",
      "nuts (cashews, almonds, raisins)"
    ],
    "benefits": ["Halwa is a sweet dish that can be enjoyed in moderation. It provides energy from carbohydrates and fats, and the nuts add healthy fats and protein."],
    "description": "Halwa is a traditional Indian sweet made from semolina cooked in ghee and flavored with cardamom. It is often garnished with nuts and served warm as a dessert or snack.",
    "steps": [
      "Heat ghee in a pan, add semolina and roast until golden brown.",
      "Add nuts and raisins, fry until golden.",
      "In a separate pot, boil water or milk with sugar until dissolved.",
      "Add the boiling liquid to the roasted semolina gradually, stirring continuously to avoid lumps.",
      "Cook on low heat until the mixture thickens and absorbs the liquid.",
      "Add cardamom powder and mix well.",
      "Cook on low heat until the mixture thickens and leaves the sides of the pan.",
      "Remove from heat and let it cool slightly.",
      "Transfer to a serving dish and garnish with more nuts if desired.",
      "Add cardamom powder and mix well.",
      "Cook for another 2-3 minutes until the halwa reaches the desired consistency.",
      "Remove from heat and let it cool slightly.",
      "Transfer to a serving dish and garnish with more nuts if desired.",
      "Serve warm as a dessert or snack."
    ]
  },
  {
    "name": "Gajar Halwa (Carrot Halwa)",
    "time": "60 min",
    "likes": 2200,
    "image": "assets/images/gajar-halwa.jpg",
    "youtube": "https://youtu.be/P0SNsqFtFMg?si=g_kTK8MLgjquSibt",
    "ingredients": [  
      "carrots",
      "milk",
      "sugar",
      "ghee (clarified butter)",
      "cardamom powder",
      "nuts (cashews, almonds, raisins)"
    ],
    "benefits": ["Gazar Halwa is a nutritious dessert made from carrots, which are rich in vitamins and antioxidants. It provides energy from carbohydrates and healthy fats from nuts."],
    "description": "Gazar Halwa is a traditional Indian dessert made from grated carrots cooked in milk and ghee, flavored with cardamom and garnished with nuts. It is a popular winter sweet enjoyed during festivals.",
    "steps": [
      "Grate carrots and set aside.",
      "In a heavy-bottomed pan, heat ghee and add grated carrots.",
      "Sauté for 5-7 minutes until the carrots soften.",
      "Add milk and cook on low heat, stirring occasionally until the milk reduces.",
      "Add sugar and mix well, cooking until the mixture thickens.",
      "Add cardamom powder and mix well.",
      "Add nuts and raisins, mix well.",
      "Cook for another 5-10 minutes until the halwa reaches the desired consistency.",
      "Remove from heat and let it cool slightly.",
      "Transfer to a serving dish and garnish with nuts.",
      "Serve warm as a dessert or snack.",
      "Gajar Halwa can be stored in the refrigerator for a few days.",
      "Reheat in the microwave or on the stove before serving.",
      "You can adjust the sweetness according to your taste.",
      "Feel free to add more nuts or dry fruits for extra flavor and nutrition.", 
      "Gajar Halwa is often enjoyed during festivals and special occasions.",
      "It can also be served with a scoop of vanilla ice cream for a delightful dessert.",
      "Enjoy the rich flavors and aroma of this traditional Indian sweet!"
    ]
  },
  {
    "name": "vada Pav",
    "time": "40 min",
    "likes": 2000,
    "image": "assets/images/vada-pav.jpg",
    "youtube": "https://youtu.be/9vB0AKrWw50?si=i6HNH-5Hg3nahNnB",
    "ingredients": [
      "potatoes",
      "bread rolls (pav)",
      "spices (cumin, mustard seeds, turmeric)",
      "green chili",
      "ginger",
      "garlic",
      "besan (gram flour)",
      "oil for frying",
      "coriander leaves"
    ],
    "benefits": ["Vada Pav is a popular street food that provides carbohydrates from bread and protein from potatoes. It can be made healthier by using less oil for frying."],
    "description": "Vada Pav is a famous Mumbai street food consisting of a spicy potato fritter (vada) sandwiched between a bread roll (pav). It is often served with chutneys and fried green chilies.",
    "steps": [
      "Boil and mash potatoes, mix with spices, green chili, ginger, and garlic.",
      "Shape the mixture into small balls (vada).",
      "Make a batter with besan, water, and spices.",
      "Dip each vada in the batter and deep fry until golden brown.",
      "Slice pav rolls in half, apply chutney on both sides.",
      "Place a vada in the center and press gently.",
      "Serve hot with fried green chilies and extra chutney on the side.",
      "Enjoy the spicy and flavorful Vada Pav as a snack or light meal.",
      "You can also add a slice of onion or tomato for extra flavor.",
      "Vada Pav is best enjoyed fresh and hot.",
      "Feel free to adjust the spice levels according to your taste.",
      "You can also serve it with a side of crispy potato chips for added crunch.", 
      "Vada Pav is a popular street food, so feel free to experiment with different chutneys and toppings.",
      "Enjoy the burst of flavors with every bite!",
      "Vada Pav is a fun and interactive dish, perfect for parties and gatherings.",
      "You can also serve it with a variety of chutneys like mint, coriander, or sweet chutney.",
      "Enjoy the spicy and flavorful Vada Pav as a snack or light meal.",
      "You can also add a slice of onion or tomato for extra flavor.",
      "Vada Pav is best enjoyed fresh and hot.",
      "Feel free to adjust the spice levels according to your taste."
    ]
  },
  {
    "name": "Aachar (Pickle)",
    "time": "30 min",
    "likes": 800,
    "image": "assets/images/aachar.jpg",
    "youtube": "https://youtu.be/Iy9U0KcL_aw?si=AHsow0A0O5oyHkrs",
    "ingredients": [
      "mango",
      "mustard seeds",
      "fenugreek seeds",
      "turmeric powder",
      "red chili powder",
      "salt",
      "oil (preferably mustard oil)",
      "vinegar (optional)"
    ],
    "benefits": ["Aachar is a flavorful condiment that can enhance the taste of meals. It is made with natural ingredients and can aid digestion due to the presence of spices."],
    "description": "Aachar is a traditional Indian pickle made with raw mangoes and spices. It is a tangy and spicy condiment that adds flavor to meals and is often served with rice or roti.",
    "steps": [  
      "Wash and cut mangoes into small pieces.",
      "In a dry pan, roast mustard seeds and fenugreek seeds until fragrant.",
      "Grind the roasted seeds into a coarse powder.",
      "In a bowl, mix mango pieces with turmeric powder, red chili powder, salt, and the ground spice mixture.",
      "Heat oil in a pan until hot, then let it cool slightly.",
      "Pour the warm oil over the mango mixture and mix well.",
      "Transfer to a clean, dry jar and let it sit for a few days to allow flavors to develop.",
      "Optionally, add vinegar for extra tanginess.",
      "Store in the refrigerator for longer shelf life.",
      "Serve with rice, roti, or as a side with any meal.",
      "Aachar can be enjoyed with parathas, sandwiches, or as a side with curries.",
      "Feel free to experiment with different fruits like lemon, lime, or mixed vegetables for variety.",
      "Aachar can be stored in an airtight container in the refrigerator for several weeks.",
      "Always use a clean, dry spoon to serve the pickle to avoid contamination.",
      "Aachar is a versatile condiment that can be enjoyed with various dishes.",
      "You can also add spices like asafoetida (hing) or garlic for additional flavor.",
      "Enjoy the tangy and spicy flavors of homemade Aachar with your meals."
    ]
  },
  {
    "name": "Aam panna (Mango Drink)",
    "time": "20 min",
    "likes": 6000,
    "image": "assets/images/aam-panna.jpg",
    "youtube": "https://youtu.be/Fs-H34GP1d4?si=VuvBPK4N3iZYMdvH",
    "ingredients": [
      "raw mangoes",
      "sugar",
      "salt",
      "black salt",
      "cumin powder",
      "mint leaves",
      "water"
    ],
    "benefits": ["Aam Panna is a refreshing summer drink made from raw mangoes. It is rich in vitamin C and helps in hydration, making it perfect for hot weather."],
    "description": "Aam Panna is a tangy and sweet Indian drink made from raw mangoes. It is a popular summer beverage known for its cooling properties and is often enjoyed chilled.",
    "steps": [
      "Boil raw mangoes in water until soft, then let them cool.",
      "Peel the mangoes and extract the pulp.",
      "In a blender, combine mango pulp, sugar, salt, black salt, cumin powder, and mint leaves.",
      "Add water as needed to achieve desired consistency.",
      "Blend until smooth and well combined.",
      "Taste and adjust sweetness or salt as needed.",
      "Serve chilled with ice cubes or refrigerate for later use.",
      "Garnish with mint leaves if desired.",
      "Aam Panna can be stored in the refrigerator for a few days.",
      "Enjoy this refreshing drink on hot summer days or as a cooling beverage anytime.",
      "You can also add a pinch of black pepper for an extra kick.",
      "Aam Panna is a great way to use up excess raw mangoes during the mango season.",
      "Feel free to adjust the sweetness and tanginess according to your taste.",
      "Aam Panna can also be served as a concentrate; just dilute with water before serving.",
      "This drink is not only delicious but also helps in preventing heatstroke and dehydration.",
      "Aam Panna is a versatile drink that can be enjoyed by people of all ages.",
      "You can also experiment with different herbs like basil or coriander for unique flavors.",
      "Enjoy the tangy and refreshing taste of Aam Panna!"
    ]
  },
  {
    "name": "Pesarattu (Green Gram Dosa)",
    "time": "30 min", 
    "likes": 1500,
    "image": "assets/images/pesarattu.jpg",
    "youtube": "https://youtu.be/kDyh_3bbryw?si=zxZeajDxDgDwD2GL",
    "ingredients": [
      "green gram (moong dal)",
      "rice",
      "ginger",
      "green chili",
      "cumin seeds",
      "salt",
      "oil for cooking"
    ],
    "benefits": ["Pesarattu is a healthy and nutritious dosa made from green gram, which is rich in protein and fiber. It is a gluten-free option and can be enjoyed with chutney or sambar."],
    "description": "Pesarattu is a traditional South Indian dosa made from green gram (moong dal) and rice. It is a nutritious and protein-rich breakfast option, often served with ginger chutney or sambar.",
    "steps": [
      "Soak green gram and rice in water for 4-5 hours or overnight.",
      "Drain and blend soaked ingredients with ginger, green chili, cumin seeds, and salt to make a smooth batter.",
      "Heat a non-stick pan or tawa, grease lightly with oil.",
      "Pour a ladleful of batter onto the pan and spread it into a thin circle.",
      "Cook on medium heat until the edges start to lift, then flip and cook the other side until golden brown.",
      "Repeat with remaining batter, adding oil as needed.",
      "Serve hot with ginger chutney or sambar.",
      "Pesarattu can also be enjoyed with coconut chutney or tomato chutney.",
      "You can add chopped onions or coriander leaves to the batter for extra flavor.",
      "This dosa is best served fresh and hot, but leftovers can be stored in the refrigerator for a day.",
      "Reheat on a tawa before serving again.",
      "Pesarattu is a versatile dish that can be enjoyed for breakfast, lunch, or dinner.",
      "Feel free to experiment with different spices or vegetables in the batter.",
      "You can also serve it with a side of yogurt for added creaminess.",
      "Pesarattu is a great option for those looking for a gluten-free and protein-rich meal.",
      "Enjoy the crispy and nutritious Pesarattu with your favorite chutney or sambar.",
      "Pesarattu is a popular dish in Andhra Pradesh and Telangana, often enjoyed during festivals and special occasions.",
      "You can also make mini pesarattu for a quick snack or appetizer.",
      "Enjoy the healthy and delicious Pesarattu as part of your balanced diet."
    ]
  },
  {
    "name": "Aloo tikki",
    "time": "30 min",
    "likes": 2000,
    "image": "assets/images/aloo-tikki.jpg",
    "youtube": "https://youtu.be/RNZ1ouYfjZk?si=SbdgV9A0eaImRobX",
    "ingredients": [
      "potatoes",
      "bread crumbs",
      "spices (cumin, coriander, garam masala)",
      "green chili",
      "ginger",
      "oil for frying",
      "chutney (optional)"
    ],
    "benefits": ["Aloo Tikki is a popular Indian snack made from spiced mashed potatoes. It is a vegetarian option that can be enjoyed with chutney or yogurt."],
    "description": "Aloo Tikki is a crispy and flavorful potato patty that is often served as a snack or appetizer. It is made with mashed potatoes mixed with spices and herbs, then shallow-fried until golden brown.",
    "steps": [
      "Boil and mash potatoes, let them cool.",
      "In a bowl, mix mashed potatoes with bread crumbs, spices, green chili, and ginger.",
      "Shape the mixture into small patties (tikki).",
      "Heat oil in a pan for shallow frying.",
      "Fry the tikki on medium heat until golden brown on both sides.",
      "Remove and drain on paper towels to remove excess oil.",
      "Serve hot with chutney or yogurt.",
      "Aloo Tikki can also be served in a burger bun with lettuce and tomato for a quick meal.",
      "You can add peas or corn to the potato mixture for added texture and flavor.",
      "Feel free to adjust the spice levels according to your taste.",
      "Aloo Tikki is a versatile snack that can be enjoyed at any time of the day.",
      "You can also bake the tikki instead of frying for a healthier option.",
      "Enjoy the crispy and flavorful Aloo Tikki with your favorite chutney or sauce.",
      "Aloo Tikki is a popular street food in India, often served with chole (chickpeas) or as part of a chaat platter.",
      "You can also make mini aloo tikki for a quick snack or appetizer.",
      "Aloo Tikki is a great option for parties and gatherings, served with a variety of dips and sauces.",
      "Enjoy the delicious and crispy Aloo Tikki as a snack or light meal.",
      "Aloo Tikki can be stored in the refrigerator for a day, reheat before serving.",
      "You can also freeze the uncooked tikki for later use, just thaw and fry when needed.",
      "Enjoy the crispy and flavorful Aloo Tikki with your favorite chutney or sauce."
    ]
  },
  {
    "name": "Anda bhurjee (Egg Bhurji)",
    "time": "20 min",
    "likes": 1500,
    "image": "assets/images/anda-bhurjee.jpg",
    "youtube": "https://youtu.be/4GvRTAR-xtA?si=JJvLguaaT349yqVc",
    "ingredients": [
      "eggs",
      "onion",
      "tomato",
      "green chili",
      "ginger-garlic paste",
      "spices (cumin, turmeric, red chili powder)",
      "coriander leaves",
      "oil or butter"
    ],
    "benefits": ["Anda Bhurji is a protein-rich dish made with eggs, which are a great source of essential nutrients. It is quick to prepare and can be enjoyed for breakfast or as a light meal."],
    "description": "Anda Bhurji is a popular Indian scrambled egg dish made with spices, onions, and tomatoes. It is a flavorful and satisfying dish that can be enjoyed with bread or roti.",
    "steps": [
      "Heat oil or butter in a pan, add cumin seeds and let them splutter.",
      "Add chopped onions and sauté until golden brown.",
      "Add ginger-garlic paste and green chili, sauté for a minute.",
      "Add chopped tomatoes and cook until soft.",
      "Add spices (turmeric, red chili powder) and mix well.",
      "Crack eggs into the pan, stir continuously to scramble them with the mixture.",
      "Cook until eggs are fully cooked but still soft.",
      "Garnish with chopped coriander leaves.",
      "Serve hot with bread, roti, or paratha.",
      "Anda Bhurji can also be served with pav (bread rolls) for a delicious meal.",
      "Feel free to add vegetables like bell peppers or peas for extra nutrition.",
      "Adjust the spice levels according to your taste preference.",
      "Anda Bhurji is a versatile dish that can be enjoyed at any time of the day.",
      "You can also add cheese for a creamy texture and flavor.",
      "Enjoy the flavorful and protein-packed Anda Bhurji as a quick meal or snack.",
      "Anda Bhurji is a popular street food in India, often served with pav or bread.",
      "You can also make mini Anda Bhurji wraps using tortillas or chapatis.",
      "Anda Bhurji is a great option for breakfast, brunch, or a light dinner.",
      "Enjoy the delicious and spicy Anda Bhurji with your favorite bread or roti.",
      "Anda Bhurji can be stored in the refrigerator for a day, reheat before serving.",
      "You can also freeze the cooked Anda Bhurji for later use, just thaw and reheat when needed.",
      "Enjoy the flavorful and protein-packed Anda Bhurji as a quick meal or snack."
    ]
  },
  {
    "name": "Bhel puri (Chaat)",
    "time": "20 min",
    "likes": 2500,
    "image": "assets/images/bhel-puri.jpg", 
    "youtube": "https://youtu.be/2KHWy7sCaVk?si=35lL020JCHq2-ha8",
    "ingredients": [
      "puffed rice",
      "onion",
      "tomato",
      "cucumber",
      "boiled potatoes",
      "green chili",
      "coriander leaves",
      "sev (crispy noodles)",
      "tamarind chutney",
      "green chutney",
      "chaat masala"
    ],
    "benefits": ["Bhel Puri is a light and healthy snack made with puffed rice and fresh vegetables. It is low in calories and can be customized with various chutneys for added flavor."],
    "description": "Bhel Puri is a popular Indian street food chaat made with puffed rice, vegetables, and tangy chutneys. It is a crunchy and flavorful snack that is often enjoyed as an evening treat.",
    "steps": [
      "In a large mixing bowl, combine puffed rice, chopped onions, tomatoes, cucumber, and boiled potatoes.",
      "Add chopped green chili and coriander leaves for flavor.",
      "Drizzle tamarind chutney and green chutney over the mixture.",
      "Sprinkle chaat masala and mix everything gently to combine.",
      "Adjust the seasoning according to taste.",
      "Top with sev for crunchiness.",
      "Serve immediately in bowls or paper cones.",
      "Bhel Puri can also be garnished with pomegranate seeds or chopped mango for extra flavor.",
      "Feel free to adjust the spice levels according to your taste preference.",
      "Bhel Puri is a versatile dish that can be enjoyed at any time of the day.",
      "You can also add roasted peanuts or chickpeas for added protein and crunch.",
      "Enjoy the tangy and spicy flavors of Bhel Puri as a quick snack or appetizer.",
      "Bhel Puri is a popular street food in India, often served at fairs and festivals.",
      "You can also make mini Bhel Puri cups using small bowls or shot glasses for parties.",
      "Bhel Puri is a great option for picnics or outdoor gatherings, easy to prepare and serve.",
      "Enjoy the delicious and crunchy Bhel Puri with your favorite chutneys and toppings.",
      "Bhel Puri can be stored in an airtight container for a few hours, but it is best enjoyed fresh.",
      "You can also prepare the ingredients in advance and mix them just before serving to keep the puffed rice crispy.",
      "Enjoy the flavorful and crunchy Bhel Puri as a quick meal or snack."
    ]
  },
  {
    "name": "Bread pakora/ bread roll",
    "time": "30 min", 
    "likes": 1800,
    "image": "assets/images/bread-pakora.jpg",
    "youtube": "https://youtu.be/_PjNcDO-uyY?si=b4Ok4SZPeiWFh6Wd",
    "ingredients": [
      "bread slices",
      "potatoes",
      "spices (cumin, coriander, garam masala)",
      "green chili",
      "ginger",
      "besan (gram flour)",
      "water",
      "oil for frying"
    ],
    "benefits": ["Bread Pakora is a crispy and flavorful snack made with bread and spiced potato filling. It can be enjoyed with chutney or ketchup and is a popular tea-time snack."],
    "description": "Bread Pakora is a popular Indian snack made by stuffing bread slices with a spiced potato filling, dipping them in a gram flour batter, and deep-frying until golden brown. It is often served with chutney or ketchup.",
    "steps": [
      "Boil and mash potatoes, mix with spices, green chili, and ginger.",
      "Cut bread slices into halves or quarters.",
      "Spread the potato filling on one slice and cover with another slice to make a sandwich.",
      "In a bowl, mix besan with water to make a smooth batter, add spices as desired.",
      "Heat oil in a pan for deep frying.",
      "Dip each bread sandwich in the besan batter, ensuring it is well coated.",
      "Carefully place the coated bread in hot oil and fry until golden brown on both sides.",
      "Remove and drain on paper towels to remove excess oil.",
      "Serve hot with chutney or ketchup.",
      "Bread Pakora can also be served with a side of yogurt for added flavor.",
      "Feel free to add chopped onions or coriander leaves to the potato filling for extra taste.",
      "Adjust the spice levels according to your taste preference.",
      "Bread Pakora is a versatile snack that can be enjoyed at any time of the day.",
      "You can also experiment with different fillings like paneer or mixed vegetables.",
      "Enjoy the crispy and flavorful Bread Pakora with your favorite chutney or sauce.",
      "Bread Pakora is a popular street food in India, often served at fairs and festivals.",
      "You can also make mini Bread Pakoras for a quick snack or appetizer.",
      "Bread Pakora is a great option for parties and gatherings, served with a variety of dips and sauces.",
      "Enjoy the delicious and crispy Bread Pakora as a snack or light meal.",
      "Bread Pakora can be stored in the refrigerator for a day, reheat before serving.",
      "You can also freeze the uncooked Bread Pakoras for later use, just thaw and fry when needed.",
      "Enjoy the crispy and flavorful Bread Pakora with your favorite chutney or sauce."
    ]
  },
  {
    "name": "Chaat (papri, aloo, raj kachori)",
    "time": "60 min",
    "likes": 3000,
    "image": "assets/images/chaat.jpg",
    "youtube": "https://youtu.be/ewgy8XMDz88?si=XfryeiwuW2_knm8d",
    "ingredients": [
      "papri (crispy dough discs)",
      "boiled potatoes",
      "chickpeas",
      "yogurt",
      "tamarind chutney",
      "green chutney",
      "spices (chaat masala, cumin powder)",
      "sev (crispy noodles)",
      "coriander leaves"
    ],
    "benefits": ["Chaat is a flavorful and satisfying snack that combines various ingredients for a burst of flavors. It can be made healthier by using less oil and fresh ingredients."],
    "description": "Chaat is a popular Indian street food that consists of a variety of savory snacks, often served with chutneys and yogurt. This recipe features a combination of papri, aloo (potatoes), and raj kachori, creating a delightful mix of textures and flavors.",
    "steps": [
      "Prepare papri by rolling out dough and frying until crispy.",
      "Boil and mash potatoes, mix with spices and set aside.",
      "In a serving plate, arrange papri as a base.",
      "Top with mashed potatoes, boiled chickpeas, and yogurt.",
      "Drizzle tamarind chutney and green chutney over the top.",
      "Sprinkle chaat masala and cumin powder for flavor.",
      "Add sev for crunchiness and garnish with chopped coriander leaves.",
      "Serve immediately to enjoy the crispy texture.",
      "Chaat can also be customized with additional toppings like pomegranate seeds or chopped onions.",
      "Feel free to adjust the spice levels according to your taste preference.",
      "Chaat is a versatile dish that can be enjoyed at any time of the day.",
      "You can also experiment with different ingredients like paneer or mixed vegetables.",
      "Enjoy the tangy and spicy flavors of Chaat as a quick snack or appetizer.",
      "Chaat is a popular street food in India, often served at fairs and festivals.",
      "You can also make mini Chaat cups using small bowls or shot glasses for parties.",
      "Chaat is a great option for picnics or outdoor gatherings, easy to prepare and serve.",
      "Enjoy the delicious and flavorful Chaat with your favorite chutneys and toppings.",
      "Chaat can be stored in an airtight container for a few hours, but it is best enjoyed fresh.",
      "You can also prepare the ingredients in advance and assemble just before serving to keep the papri crispy.",
      "Enjoy the flavorful and crunchy Chaat as a quick meal or snack."
    ]
  },
  {
    "name": "Chicken pakora (Chicken fritters)",
    "time": "40 min",
    "likes": 2800,
    "image": "assets/images/chicken-pakora.jpg",
    "youtube": "https://youtu.be/BjbPZQJP7uc?si=lSLj2-i8adrQ5F8d",
    "ingredients": [  
      "chicken breast",
      "besan (gram flour)",
      "spices (cumin, coriander, garam masala)",
      "ginger-garlic paste",
      "green chili",
      "lemon juice",
      "salt",
      "oil for frying"
    ],
    "benefits": ["Chicken Pakora is a delicious and crispy snack made with marinated chicken pieces. It is a good source of protein and can be enjoyed with chutney or sauce."],
    "description": "Chicken Pakora is a popular Indian snack made by marinating chicken pieces in spices and besan (gram flour), then deep-frying until golden brown. It is often served as an appetizer or snack with chutney.",
    "steps": [
      "Cut chicken breast into bite-sized pieces.",
      "In a bowl, mix besan, spices, ginger-garlic paste, green chili, lemon juice, and salt to make a thick batter.",
      "Add chicken pieces to the batter and coat well.",
      "Let it marinate for at least 30 minutes.",
      "Heat oil in a pan for deep frying.",
      "Carefully drop marinated chicken pieces into hot oil and fry until golden brown and cooked through.",
      "Remove and drain on paper towels to remove excess oil.",
      "Serve hot with mint chutney or ketchup.",
      "Chicken Pakora can also be served with a side of sliced onions and lemon wedges.",
      "Feel free to adjust the spice levels according to your taste preference.",
      "Chicken Pakora is a versatile snack that can be enjoyed at any time of the day.",
      "You can also experiment with different marinades or add vegetables to the batter for extra flavor.",
      "Enjoy the crispy and flavorful Chicken Pakora as a quick meal or snack.",
      "Chicken Pakora is a popular street food in India, often served at fairs and festivals.",
      "You can also make mini Chicken Pakoras for a quick snack or appetizer.",
      "Chicken Pakora is a great option for parties and gatherings, served with a variety of dips and sauces.",
      "Enjoy the delicious and crispy Chicken Pakora as a snack or light meal.",
      "Chicken Pakora can be stored in the refrigerator for a day, reheat before serving.",
      "You can also freeze the uncooked Chicken Pakoras for later use, just thaw and fry when needed.",
      "Enjoy the crispy and flavorful Chicken Pakora with your favorite chutney or sauce.",
      "Chicken Pakora can be served with a side of yogurt for added creaminess.",
      "You can also add chopped coriander leaves to the batter for extra flavor.",
      "Enjoy the crispy and flavorful Chicken Pakora with your favorite chutney or sauce."
    ]
  },
  {
    "name": "Dal baati churma (Dal, Baati, and Churma)",
    "time": "120 min",
    "likes": 3500,
    "image": "assets/images/dal-baati-churma.jpg",
    "youtube": "https://youtu.be/mZ4xTelTAGk?si=0rPVJMeHI6SmR-Ek",
    "ingredients": [
      "whole wheat flour (for baati)",
      "ghee (clarified butter)",
      "dal (lentils)",
      "spices (cumin, coriander, garam masala)",
      "jaggery (for churma)",
      "sugar",
      "water",
      "salt"
    ],
    "benefits": ["Dal Baati Churma is a traditional Rajasthani dish that provides a balanced meal with protein from lentils, carbohydrates from baati, and healthy fats from ghee. It is a wholesome and filling dish."],
    "description": "Dal Baati Churma is a traditional Rajasthani dish consisting of three components: dal (lentils), baati (hard wheat rolls), and churma (sweetened crushed baati). It is a hearty and flavorful meal often enjoyed during festivals and special occasions.",
    "steps": [
      "For baati, knead whole wheat flour with ghee and water to make a stiff dough.",
      "Divide the dough into small balls and flatten them slightly.",
      "Preheat the oven to 200°C (400°F) and bake the baatis until golden brown and cooked through.",
      "For dal, boil lentils with water, salt, and spices until soft.",
      "In a separate pan, heat ghee and add cumin seeds, then add chopped onions and sauté until golden brown.",
      "Add tomatoes and cook until soft, then add boiled lentils and simmer for 10-15 minutes.",
      "For churma, crush baked baatis into crumbs, mix with ghee, jaggery, and sugar until well combined.",
      "Serve hot dal with baati dipped in ghee and churma on the side.",
      "Dal Baati Churma can also be served with a side of pickles or raita for added flavor.",
      "Feel free to adjust the spice levels according to your taste preference.",
      "Dal Baati Churma is a versatile dish that can be enjoyed at any time of the day.",
      "You can also experiment with different types of lentils for the dal.",
      "Enjoy the rich and flavorful Dal Baati Churma as a complete meal.",
      "Dal Baati Churma is a popular dish in Rajasthan, often served at weddings and special occasions.",
      "You can also make mini baatis for a quick snack or appetizer.",
      "Dal Baati Churma is a great option for parties and gatherings, served with a variety of dips and sauces.",
      "Enjoy the delicious and hearty Dal Baati Churma as a main course meal.",
      "Dal Baati Churma can be stored in the refrigerator for a day, reheat before serving.",
      "You can also freeze the uncooked baatis for later use, just thaw and bake when needed.",
      "Enjoy the rich and flavorful Dal Baati Churma as a complete meal.",
      "Dal Baati Churma can be served with a side of yogurt for added creaminess.",
      "You can also add chopped coriander leaves to the dal for extra flavor.", 
      "Enjoy the rich and flavorful Dal Baati Churma as a complete meal."
    ]
  }

  
]